<template>
    <div :class="['flex', { show: showFlex }]">dsfsdf</div>
    <p>「大家會擔心有一天在網路看到自己嗎？」一名網友日前發文指出，使用Threads時意外發現，好多人會分享生活中雞毛蒜皮的小事，配圖卻是偷拍視角，讓她很震驚。貼文一出，掀起不少人共鳴，因此現象越來越常見，如今出門都必須戴口罩，擔心自己一不小心就出現在網路上。

        網友近日開始滑Threads，看到不少類似的貼文，並分析，最容易被公開分享的事件包括：未給孕婦讓位、超商服務使用時間太長、穿搭相關、因外貌姣好企圖發文搭訕對方等，還有人會懷疑路人是中國遊客，邊錄影邊衝上前要求刪除照片。

        網友接著說，這類型的貼文都會以拍照或錄影的方式，直接對著陌生人偷拍，甚至還會放大目標人物，讓她滑手機時開始擔心，有一天會在網路上看到自己。網友無奈的說，「現在開始覺得是不是自己哪天也會被發到網路上，還是其實已經被發過了自己不知道…」

        Dcard貼文曝光引起討論，許多人認同其說法，「現在真的好多偷拍，拍的還都是芝麻小屁事，有些還搭配限動放大臉」、「所以我在外面都戴口罩」、「Threads根本就是公審平台，看人不爽就拍下來發文，一堆沒禮貌的人」、「疫情後覺得口罩超好用，除了防病毒，還能防被公審」、「原來不是只有我會擔心」。

        部分網友也坦承害怕自己被公審，「怕小孩（1歲整）一哭就被拍照放上網說不會教就不要生，不要帶出門」；不過，也有網友完全不在乎，「我也不是什麼知名人物，就算PO了也不會有人在意」、「覺得大家要有一個認知，網路上的一切真的是這個世界小到不能再小的一部分」、「真的沒有做錯輿論也不會虧待你」。
    </p>
    <p>「大家會擔心有一天在網路看到自己嗎？」一名網友日前發文指出，使用Threads時意外發現，好多人會分享生活中雞毛蒜皮的小事，配圖卻是偷拍視角，讓她很震驚。貼文一出，掀起不少人共鳴，因此現象越來越常見，如今出門都必須戴口罩，擔心自己一不小心就出現在網路上。

        網友近日開始滑Threads，看到不少類似的貼文，並分析，最容易被公開分享的事件包括：未給孕婦讓位、超商服務使用時間太長、穿搭相關、因外貌姣好企圖發文搭訕對方等，還有人會懷疑路人是中國遊客，邊錄影邊衝上前要求刪除照片。

        網友接著說，這類型的貼文都會以拍照或錄影的方式，直接對著陌生人偷拍，甚至還會放大目標人物，讓她滑手機時開始擔心，有一天會在網路上看到自己。網友無奈的說，「現在開始覺得是不是自己哪天也會被發到網路上，還是其實已經被發過了自己不知道…」

        Dcard貼文曝光引起討論，許多人認同其說法，「現在真的好多偷拍，拍的還都是芝麻小屁事，有些還搭配限動放大臉」、「所以我在外面都戴口罩」、「Threads根本就是公審平台，看人不爽就拍下來發文，一堆沒禮貌的人」、「疫情後覺得口罩超好用，除了防病毒，還能防被公審」、「原來不是只有我會擔心」。

        部分網友也坦承害怕自己被公審，「怕小孩（1歲整）一哭就被拍照放上網說不會教就不要生，不要帶出門」；不過，也有網友完全不在乎，「我也不是什麼知名人物，就算PO了也不會有人在意」、「覺得大家要有一個認知，網路上的一切真的是這個世界小到不能再小的一部分」、「真的沒有做錯輿論也不會虧待你」。
    </p>
    <div class="box">

        box
    </div>
    <p>「大家會擔心有一天在網路看到自己嗎？」一名網友日前發文指出，使用Threads時意外發現，好多人會分享生活中雞毛蒜皮的小事，配圖卻是偷拍視角，讓她很震驚。貼文一出，掀起不少人共鳴，因此現象越來越常見，如今出門都必須戴口罩，擔心自己一不小心就出現在網路上。

        網友近日開始滑Threads，看到不少類似的貼文，並分析，最容易被公開分享的事件包括：未給孕婦讓位、超商服務使用時間太長、穿搭相關、因外貌姣好企圖發文搭訕對方等，還有人會懷疑路人是中國遊客，邊錄影邊衝上前要求刪除照片。

        網友接著說，這類型的貼文都會以拍照或錄影的方式，直接對著陌生人偷拍，甚至還會放大目標人物，讓她滑手機時開始擔心，有一天會在網路上看到自己。網友無奈的說，「現在開始覺得是不是自己哪天也會被發到網路上，還是其實已經被發過了自己不知道…」

        Dcard貼文曝光引起討論，許多人認同其說法，「現在真的好多偷拍，拍的還都是芝麻小屁事，有些還搭配限動放大臉」、「所以我在外面都戴口罩」、「Threads根本就是公審平台，看人不爽就拍下來發文，一堆沒禮貌的人」、「疫情後覺得口罩超好用，除了防病毒，還能防被公審」、「原來不是只有我會擔心」。

        部分網友也坦承害怕自己被公審，「怕小孩（1歲整）一哭就被拍照放上網說不會教就不要生，不要帶出門」；不過，也有網友完全不在乎，「我也不是什麼知名人物，就算PO了也不會有人在意」、「覺得大家要有一個認知，網路上的一切真的是這個世界小到不能再小的一部分」、「真的沒有做錯輿論也不會虧待你」。
    </p>
    <p>「大家會擔心有一天在網路看到自己嗎？」一名網友日前發文指出，使用Threads時意外發現，好多人會分享生活中雞毛蒜皮的小事，配圖卻是偷拍視角，讓她很震驚。貼文一出，掀起不少人共鳴，因此現象越來越常見，如今出門都必須戴口罩，擔心自己一不小心就出現在網路上。

        網友近日開始滑Threads，看到不少類似的貼文，並分析，最容易被公開分享的事件包括：未給孕婦讓位、超商服務使用時間太長、穿搭相關、因外貌姣好企圖發文搭訕對方等，還有人會懷疑路人是中國遊客，邊錄影邊衝上前要求刪除照片。

        網友接著說，這類型的貼文都會以拍照或錄影的方式，直接對著陌生人偷拍，甚至還會放大目標人物，讓她滑手機時開始擔心，有一天會在網路上看到自己。網友無奈的說，「現在開始覺得是不是自己哪天也會被發到網路上，還是其實已經被發過了自己不知道…」

        Dcard貼文曝光引起討論，許多人認同其說法，「現在真的好多偷拍，拍的還都是芝麻小屁事，有些還搭配限動放大臉」、「所以我在外面都戴口罩」、「Threads根本就是公審平台，看人不爽就拍下來發文，一堆沒禮貌的人」、「疫情後覺得口罩超好用，除了防病毒，還能防被公審」、「原來不是只有我會擔心」。

        部分網友也坦承害怕自己被公審，「怕小孩（1歲整）一哭就被拍照放上網說不會教就不要生，不要帶出門」；不過，也有網友完全不在乎，「我也不是什麼知名人物，就算PO了也不會有人在意」、「覺得大家要有一個認知，網路上的一切真的是這個世界小到不能再小的一部分」、「真的沒有做錯輿論也不會虧待你」。
    </p>
    <div :class="['flex-box', { show: showboxFlex }]">flex-boxflex-box</div>
</template>

<script setup lang="ts">
import { ref, onMounted, onUnmounted } from 'vue'
const showFlex = ref(false)

const showboxFlex = ref(false)
const scrollFun = () => {
    const box = document.querySelector('.box')
    if (box) {
        const rect = box.getBoundingClientRect()
        // const windowHeight = window.innerHeight
        // 如果 .box 距離視窗頂部 <= 100px，顯示 flex
        if (rect.top <= 100) {
            showFlex.value = true
            showboxFlex.value = true
        } else {
            showFlex.value = false
            showboxFlex.value = false
        }

        // 在 box 區域範圍內，flex 從上滑下來
        // if (rect.top <= 100 && rect.bottom >= windowHeight) {
        //     // showFlex.value = false
        //     // showboxFlex.value = false
        //     console.log(1);

        // }
        // // 超過 box 區域，flex 從下滑上來
        // else if (rect.bottom < windowHeight) {
        //     showFlex.value = true
        //     console.log(2);

        //     showboxFlex.value = true
        // }
        // // 沒進入範圍，隱藏
        // else {
        //     console.log(3);
        //     showFlex.value = false
        //     showboxFlex.value = false
        //     // position.value = 'hidden'
        // }


    }
}
onMounted(() => {
    window.addEventListener('scroll', scrollFun)
})

onUnmounted(() => {
    window.removeEventListener('scroll', scrollFun)
})
</script>

<style>
.flex {
    position: fixed;
    top: -50px;
    left: 0;
    width: 100%;
    height: 50px;
    background: #333;
    color: white;
    display: flex;
    align-items: center;
    justify-content: center;
    transition: top 0.3s ease;
}

.flex.show {
    top: 0;
}

.box {
    border: solid 1px;
    width: 100%;
    height: 300px;
    margin-top: 1000px;
}

.flex-box {
    position: fixed;
    bottom: -50px;
    left: 0;
    width: 100%;
    height: 50px;
    background: #333;
    color: white;
    display: flex;
    align-items: center;
    justify-content: center;
    transition: top 0.3s ease;
}


.flex-box.show {
    bottom: 0;
}
</style>